_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_1 (InputLayer)         [(None, 12, 12, 1)]       0
_________________________________________________________________
conv2d (Conv2D)              (None, 12, 12, 128)       1280
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 12, 12, 128)       0
_________________________________________________________________
flatten (Flatten)            (None, 18432)             0
_________________________________________________________________
dense (Dense)                (None, 128)               2359424
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 128)               0
_________________________________________________________________
dense_1 (Dense)              (None, 132)               17028
=================================================================
Total params: 2,377,732
Trainable params: 2,377,732
Non-trainable params: 0
_________________________________________________________________